# Brew
brew "asdf"                     # Version manager for multiple languages
brew "curl"                     # u know...
brew "git"                      # Recent version of git
brew "jq"
brew "wget"                     # wget command for downloading files
brew "tree"                     # Tree command for directory structure
brew "zsh-autosuggestions"      # Autosuggestions for zsh
brew "zsh-syntax-highlighting"  # Syntax highlighting for zsh
brew "mas"                      # Manage Mac App Store apps from the command line
brew "yt-dlp"                   # YouTube downloader
brew "zsh"                      # Zsh shell

# Casks
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # Aerospace window manager
cask "alacritty"                 # Fast, minimal terminal
cask "spotify"                   # Ear candy
cask "vlc"                       # Video player
cask "1password"                 # Password manager
cask "cursor"                    # Code editor
cask "league-of-legends"         # tft
cask "shottr"                    # Screenshot tool
cask "localsend"                 # File sharing

# App Store apps
mas "Tailscale", id: 1475387142       # Tailscale
mas "WhatsApp", id: 1147396723        # WhatsApp
mas "Menu World Time", id: 1446377255 # Menu World Time
mas "Flycut", id: 442160987           # Clipboard manager
mas "Passepartout", id: 1433648537    # vpn client

# Fonts
cask "font-b612-mono" # Monospace font

# VSCode extensions
vscode "anysphere.remote-ssh" # Remote SSH extension
