# Brew
brew "asdf" # Version manager for multiple languages
brew "curl" # u know...
brew "git" # Recent version of git
brew "jq"
brew "wget" # wget command for downloading files
brew "tree" # Tree command for directory structure
brew "zsh-autosuggestions" # Autosuggestions for zsh
brew "zsh-syntax-highlighting" # Syntax highlighting for zsh
brew "mas" # Manage Mac App Store apps from the command line
brew "yt-dlp" # YouTube downloader

# Casks
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # Aerospace window manager
cask "alacritty"            # Fast, minimal terminal
cask "spotify"              # Ear candy
cask "vlc"                  # Video player

# App Store apps
mas "Hidden Bar", id: 1452453066
mas "Tailscale", id: 1475387142
mas "WhatsApp", id: 1147396723

# Fonts
cask "font-b612-mono"

# VSCode extensions
vscode "anysphere.remote-ssh"