# Brew
brew "asdf"                     # version manager for multiple languages
brew "curl"                     # u know...
brew "git"                      # recent version of git
brew "jq"                       # json processor
brew "wget"                     # wget command for downloading files
brew "tree"                     # tree command for directory structure
brew "zsh-autosuggestions"      # autosuggestions for zsh
brew "zsh-syntax-highlighting"  # syntax highlighting for zsh
brew "mas"                      # mac app store apps from the command line
brew "yt-dlp"                   # youtube downloader
brew "zsh"                      # zsh shell
brew "stow"                     # package manager for dotfiles

# Casks
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # window manager
cask "spotify"                   # ear candy
cask "vlc"                       # video player
cask "1password"                 # password manager
cask "1password-cli"             # 1password cli
cask "zed"                       # ide
cask "google-chrome"             # browser
cask "plex"                      # media player
cask "ghostty"                   # terminal
cask "wifiman"                   # unifi
cask "rapidapi"                  # api client
cask "shottr"                    # screenshot tool
cask "claude-code"               # claude code assistant

# custom
tap "alexraskin/tap"             # my custom tap
brew "alexraskin/tap/todo"       # simple todo app
brew "alexraskin/tap/ata"        # ata

# App Store apps
mas "Tailscale", id: 1475387142                  # tailscale
mas "WhatsApp Messenger", id: 310633997          # whatsapp
mas "Menu World Time", id: 1446377255            # menu world time
mas "Flycut", id: 442160987                      # clipboard manager
mas "Passepartout", id: 1433648537               # passepartout

# Fonts
cask "font-b612"
cask "font-b612-mono"
cask "font-iosevka"

# VSCode extensions
vscode "anysphere.remote-ssh" # remote ssh extension
vscode "catppuccin.catppuccin-vsc" # catppuccin theme
